import { Modal } from 'flowbite-react';
import React from 'react';
import AOS from 'aos';
import 'aos/dist/aos.css';
import { useEffect } from 'react';

interface TermsOfServiceProps {
  openTermsOfServiceModal: string | undefined;
  setOpenTermsOfServiceModal: React.Dispatch<
    React.SetStateAction<string | undefined>
  >;
}

export default function TermsOfSerivceModal({
  openTermsOfServiceModal,
  setOpenTermsOfServiceModal,
}: TermsOfServiceProps) {
  useEffect(() => {
    AOS.init();
  }, []);

  return (
    <Modal
      show={openTermsOfServiceModal === 'default'}
      onClose={() => setOpenTermsOfServiceModal(undefined)}
      data-aos='fade-zoom'
      data-aos-duration='300'
    >
      <Modal.Header>서비스 이용 약관</Modal.Header>
      <Modal.Body className='max-h-[27.5rem]'>
        <div className='space-y-6'>
          <div>
            <p className='font-semibold text-[0.5rem] underline'>제1장. 총칙</p>
            <div>
              <p className='mt-4 text-xs font-medium'>제1조 (목적)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                본 약관은 주식회사 피치그로브(이하 “회사”)가 운영하는 구독공유
                플랫폼, 버디(이하 “플랫폼”)을 이용함에 있어 “회사”와 “회원”의
                권리·의무 및 책임사항을 규정하기 위한 목적입니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>
                제2조 (약관의 명시와 설명 및 개정)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회사”는 본 약관을 회원 가입 과정과 “플랫폼”의 내부 메뉴에
                게시합니다. 다만, 약관의 내용은 “이용자”가 연결화면을 통하여
                확인하도록 할 수 있습니다.
                <br />
                2. “회사”는 「전자상거래 등에서의 소비자보호에 관한 법률」,
                「약관의 규제에 관한 법률」, 「전자문서 및 전자거래기본법」,
                「전자금융거래법」, 「전자서명법」, 「정보통신망 이용촉진 및
                정보보호 등에 관한 법률」, 「소비자기본법」 등 관련 법을
                위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.
                <br />
                3. “회사”는 약관을 개정하는 경우, 적용 일자로부터 7일 이전부터
                적용일자와 개정 사유를 명시하여 “플랫폼”의 초기 화면에
                공지합니다. 다만, “플랫폼”에 대한새로운 기능과 관련된 변경이나
                법률적인 사유로 인한 변경은 사전 공지 없이 즉시 개정될 수
                있습니다.
                <br />
                4. 공지 일자로부터 14일 이내에 “회원”이명시적으로 거부하지 않은
                경우, 개정 약관에 동의한 것으로 간주합니다.
                <br />
                5. “회원”이 “회사”에 개정에 동의하지 않는다는 의사를 명시적으로
                표시한경우, “회원”은 적용 일자부터 “플랫폼”을 이용할 수
                없습니다. 다만, 적용 일자 이전에 체결한 공유 건이 있다면 개정 전
                약관의 적용을 받아 해당 공유 건의 종료일까지 제한적으로“플랫폼”
                이용이 가능합니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>제3조 (약관의 해석)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회사”는 필요한 경우 “플랫폼” 내부의 개별 항목에 대해서
                별도의 이용약관 및 정책을 고지하고, 적용할 수 있습니다. 해당
                내용이 본 약관과 충돌하는 경우 개별 항목에 대한 이용 약관 혹은
                정책을 우선하여 적용합니다.
                <br />
                2. 본 약관에서 정하지 않은 사항이나 해석에 대하여는 관련 법령
                또는 상관례에 따릅니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>제4조 (용어의 정의)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                “플랫폼” 내부에서 사용하는 용어는 플랫폼 내부의 정의를 우선하여
                따릅니다. 본 조에서 정하지 아니하였거나, “플랫폼” 내부의 별도
                설명이 없는 경우 관계법령 및 일반 관례를 따릅니다.
                <br />
                1. 회원: “회사”에 개인정보를 제공하여 회원등록을 한 “이용자”를
                말합니다.
                <br />
                2. 비회원: 회원등록 없이 “플랫폼”에 접속한 “이용자”로서,
                기능이용에 일부 제한을 받습니다.
                <br />
                3. 닉네임: 회원의 사생활 보호를 위해서 “플랫폼” 이용 시 사용하는
                별칭을 말합니다.
                <br />
                4. 파티: 구독 서비스를 공유하는 “회원”의 집합을 말합니다.
                <br />
                5. 파티장: 구독 서비스를 직접 결제하여, 파티의 구성원들과
                공유하는 “회원”을 말합니다.
                <br />
                6. 파티원: 파티장에게 공유 비용을 지불하고, 구독 서비스 권한을
                공유 받는“회원”을 말합니다.
                <br />
                7. 플랫폼: “회사”가 제공하는 “구독공유약정거래 시스템”을
                말합니다.
                <br />
                8. 대상 서비스: “플랫폼”에서 지원하는 구독 서비스를 의미합니다.
                <br />
                9. 구독공유: “파티장”이 “파티원”들에게 구독 서비스의 이용권한을
                나눠주는 것을 말합니다.
                <br />
                10. 공유정보: 파티 구성원 간 공유하는 대상 서비스의 로그인 정보
                등을 의미합니다.
                <br />
                11. 약정의무: 파티에 속한 “회원”들이 준수해야 하는 의무사항을
                말합니다.
                <br />
                12. 약정기간: 파티에 속한 “회원”들이 약정의무를 준수해야 하는
                유지기간을 의미합니다.
                <br />
                13. 파티 시작일: “약정 기간”의 시작일을 의미합니다.
                <br />
                14. 파티 종료일: “약정 기간”의 종료일을 의미합니다.
                <br />
                15. 정산일: “플랫폼”에서 이용 중 파티의 결제/적립이 이루어지는
                날짜입니다.
                <br />
                16. 파티요금: 대상 서비스를 구독 공유 받기 위해 파티원이 버디에
                결제하는 비용입니다. 파티 요금은 분담금과 버디 이용료로 구성되어
                있습니다.
                <br />
                17. 분담금: 파티원이 지불한 파티요금 중 “파티장”에게 정산되는
                비용입니다. 파티장은 매달 “정산일”에 해당 파티의 “분담금”에서
                버디 이용료를 공제하여 “버디 머니”로 적립 받습니다.
                <br />
                18. 버디 이용료: 파티 구성원들이 파티 이용에 대해서 “플랫폼”에
                지불하는 비용입니다.
                <br />
                19. 위약금: 파티 구성원이 약정 위반 시 다른 파티 구성원의 피해를
                일부 구제하기 위해 지불하는 비용입니다. 파티를 생성하거나 가입
                시 동의를 받아 지불합니다.
                <br />
                20. 보증금: 파티를 생성하거나 가입 시 야기할 수 있는 약정 위반에
                대해 다른 구성원들의 피해 구제를 일부 담보하기 위해 버디에
                임시로 거치한 일시금을 의미합니다. 약정 종료 시 개인에게
                “버디머니”로 환급합니다.
                <br />
                21. 리워드: 파티 규칙을 준수하며, 약정을 완료한 경우 추가 적립
                받는 버디머니입니다.
                <br />
                22. 버디 머니: “플랫폼”에서 현금과 동일하게 사용할 수 있는
                재화입니다.
                <br />
                23. 인출: 버디 머니를 등록한 본인 명의의 계좌로 송금받는 것을
                의미합니다.
              </p>
            </div>
          </div>

          <hr />

          <div>
            <p className='font-semibold text-[0.5rem] underline'>
              제2장. 플랫폼 이용계약
            </p>
            <div>
              <p className='mt-4 text-xs font-medium'>
                제5조 (이용계약의 성립)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. 플랫폼 이용계약(이하 ‘이용계약’)은 비회원의 이용신청에 대한
                “회사”의 승낙으로 성립됩니다.
                <br />
                2. 비회원이 회원등록절차를 통해 “플랫폼”을 이용하고자 하는 경우,
                비회원은“플랫폼”이 요청하는 개인 신상정보를 제공해야 합니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>제6조 (이용신청)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “플랫폼”을 이용하고자 하는 비회원은 다음 회원등록 절차를 거쳐
                이용신청을 진행합니다.
                <br />
                i. 로그인 연동 서비스(카카오, 네이버, 구글, 애플 등) 정보제공
                동의
                <br />
                ii. 본인 명의 인증
                <br />
                iii. 이용약관 동의
                <br />
                iv. 닉네임 설정
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>
                제7조 (이용신청의 승낙)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. 플랫폼은 이용신청자가 회원등록 절차를 정상적으로 거쳤을 때
                “플랫폼” 이용을 승낙하는 것을 원칙으로합니다.
                <br />
                2. 이용신청의 승낙 처리는 신청순서를 따릅니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>
                제8조 (이용신청에 대한 승낙의 제한)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. 대한민국 민법상으로 만 19세에 달하지 않은 경우
                <br />
                2. 실명이 아니거나 타인의 명의를 이용한경우
                <br />
                3. 이용신청자가 본 약관에 의하여 이전에 회원자격을 상실한 적이
                있는 경우. 단, “플랫폼”의 판단으로 회원 재가입 승낙을 얻은
                경우에는 예외로 함.
                <br />
                4. 이용신청자의 귀책사유로 인하여 승인이 불가능하거나 기타
                규정한 제반 사항을 위반하며 신청하는 경우
                <br />
                5. 허위의 정보를 기재하거나 플랫폼 회원등록절차에서 제시하는
                내용을 기재하지 않은 경우
                <br />
                6. 이용계약의 성립 및 승낙이 “회사”의 업무 수행에 지장이 있다고
                인정되는 경우
              </p>
            </div>
          </div>

          <hr />

          <div>
            <p className='font-semibold text-[0.5rem] underline'>
              제3장. 플랫폼이용
            </p>
            <div>
              <p className='mt-4 text-xs font-medium'>
                제9조 (플랫폼의 이용개시)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회사”는 “회원”의 이용 신청을 승낙하면 즉시 플랫폼을 이용을
                시작할수 있도록 합니다.
                <br />
                2. “회사”는 업무상 또는 기술상의 장애로 인하여 “플랫폼”을 이용을
                시작할수 없는 경우에는 공지사항이나 저장된 연락처 등을 통해
                “회원”에게 이를 통지합니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>
                제10조 (플랫폼의 제공기능)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “플랫폼”에서 “회원”에게 제공하는 기능은 아래와 같습니다.
                <br />
                i. 구독공유 파티 생성 및 가입 기능
                <br />
                ii. 구독공유 파티 약정거래 기능
                <br />
                iii. 구독공유 파티 공유 대금의 정기 결제 및 적립 등 자동 정산
                기능
                <br />
                iv. 기타 구독공유 파티 유지 관리에 필요한 편의 기능
                <br />
                2. “플랫폼”에서 제공하는 기능은 “회사”의 정책 및 운영의 필요상
                수정, 중단, 변경할 수 있으며 이에대하여 관련법에 특별한 규정이
                없는 한 “회원”에게 별도의 보상을 하지 않습니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>
                제11조 (플랫폼의 이용시간)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “플랫폼”의 이용은 “회사”의 업무상또는 기술상의 특별한 지장이
                없는 한 연중무휴, 1일 24시간을원칙으로 합니다.
                <br />
                2. 다음 각 호에 해당하는 경우에 “회사”는 “플랫폼”의 웹페이지 및
                어플리케이션에 그 사유 및 기간을 공지하고 플랫폼 이용을 중지할
                수 있습니다.
                <br />
                i. “플랫폼”의 개선을 위한 정기점검, 통신회선의 장애 등 “회사”가
                “플랫폼”의 제공을 정지할 필요가 있다고 판단되는 경우
                <br />
                ii. 천재지변, 국가비상사태, 정전, 플랫폼 설비의 장애 등으로
                정상적인 “플랫폼” 이용에 지장이 있을 경우 기능
                <br />
                iii. 기타 “회사”와 “회원”이 협의한 경우
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>
                제12조 (정보의 제공 및 광고의 게재)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. 회사는 회원이서비스 이용 중 필요하다고 인정되는 다양한 정보를
                공지사항이나 전자우편, 어플리케이션 푸시 메시지(이하
                “푸시메시지”) 등의 방법으로 회원에게 제공할 수 있습니다. 다만,
                회원은 파티의 운영과 결제에 대한 메시지나 관련법에 따른 거래관련
                정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 수신
                거절을 할 수 있습니다.
                <br />
                2. 제1항의 정보를 전화 및 모사전송기기에 의하여 전송하려고 하는
                경우에는 회원의 사전 동의를 받아서 전송합니다. 다만, 회원의
                거래관련 정보 및 고객문의 등에 대한 회신에 있어서는 제외됩니다.
                <br />
                3. 회사는 플랫폼의 운영과 관련하여 서비스 화면, 홈페이지,
                전자우편, 푸시메시지 등에 광고를 게재할 수 있습니다. 광고가
                게재된 전자우편, 푸시등을 수신한 회원은 수신거절을 회사에게 할
                수 있습니다.
              </p>
            </div>
          </div>

          <hr />

          <div>
            <p className='font-semibold text-[0.5rem] underline'>
              제4장. 계약당사자의의무
            </p>
            <div>
              <p className='mt-4 text-xs font-medium'>제13조 (회사의 의무)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. 회사는 법령과 본 약관이 정하는 권리의 행사와 의무의 이행을
                신의에 좇아 성실하게 하여야 합니다.
                <br />
                2. 회사는 회원이 안전하게 플랫폼을 이용할 수 있도록
                개인정보보호를 위해 보안시스템을 갖추어야 하며
                개인정보보호정책을 공시하고 준수합니다.
                <br />
                3. 회사는 회원이 플랫폼 이용 및 그 대금내역을 수시로 확인할 수
                있도록 조치합니다. 이를 위해 회사는 파티의 공유정보를 조회할 수
                있습니다.
                <br />
                4. “회사”는 “회원”이 “파티” 이용과 관련한 대금을 지급받는 경우
                “버디 머니”로 지급합니다.
                <br />
                5. “회사”는 “버디 머니”를 “회원”이 본인 명의 계좌로 인출할 수
                있도록 관련 기능을 제공합니다. 단, “회사”는 입금과 관련한 최소
                금액과 월별 인출 횟수 제한을 설정할수 있습니다.
                <br />
                6. 회사는 플랫폼 이용과 관련하여 회원이 제기한 의견이나 불만이
                정당하다고 인정할 경우에는 이를 지체없이 처리합니다. 플랫폼이
                제기한 의견이나 불만사항에 대해서는 웹페이지나 어플리케이션
                내부의 고객문의 기능을 활용하거나 문자 메시지 서비스 등을 통하여
                그 처리과정 및 결과를 전달합니다.
                <br />
                7. 회사는 플랫폼의 정책 변경으로 인해 기존 파티의 지속이 어려운
                경우, 해당 서비스 파티의 일정이나 비용 등을 변경할 수 있습니다.
                <br />
                8. “회사”는 선의의 “회원”이 파티 규칙을 준수하지 않는 다른 파티
                구성원으로부터 피해를 입는 경우, 피해자의 구제 행위에 최선을
                다해 협력합니다.
                <br />
                9. 회사는 본 약관에서 정한 의무 위반으로 인하여 회원이 입은
                손해를 배상합니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>제14조 (회원의 의무)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. 회원은다음 행위를 하여서는 안 됩니다.
                <br />
                i. 회원 등록 시 타인의 명의를 도용하는 행위
                <br />
                ii. 결제 정보 등록 시 타인 혹은 허위의 결제 정보를 기재하는 행위
                <br />
                iii. 파티 생성 또는 가입 시 정상적 구독공유가 불가능한 허위
                내용을 기재하는 행위
                <br />
                iv. 플랫폼에 게시된 정보의 변경
                <br />
                v. 플랫폼에서 금지한 정보(컴퓨터 프로그램 등)의 송신 또는 게
                <br />
                vi. 플랫폼과 기타 제3자의 저작권 등 지적재산권에 대한 침해
                <br />
                vii. 플랫폼 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는
                행위
                <br />
                viii. 외설 또는 폭력적인 말이나 글, 화상, 음향, 기타 공서양속에
                반하는 정보를 플랫폼을 통해 전송하거나 게시하는 행위
                <br />
                ix. 기타 불법적이거나 부당한 행위
                <br />
                2. “회원”은 다음 행위 시 불이익을 받을 수 있습니다.
                <br />
                i. “파티장” 혹은 “파티원”으로 속한 파티의 약정 기간을 준수하지
                않는 경우
                <br />
                ii. “파티장”인 경우 파티 구성원 변동에 따른 계정 정보 변경
                요청에 응하지 않는 경우
                <br />
                iii. “회원”이 등록한 결제수단이 유효기간 만료, 계약 해지 등으로
                인해 정상적 결제가 되지 않는 경우
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>
                제15조 (회원에 대한 통지)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회원”에 대한 통지를 하는 경우 “회사”는 “회원”이 등록한
                이메일 주소 또는 문자 메시지, 푸시 메시지 등으로 할 수 있습니다.
                <br />
                2. “회원”의 연락처 미 기재, 변경 등으로 인하여 개별 통지가
                어려운 경우, “회원”이 등록한 연락처로 통지를 하였음에도 2회 이상
                반송된 경우 “회사”는 플랫폼 내부의 공지사항, 팝업배너 등에 7일
                이상 게시함으로써 개별 통지에 갈음할 수 있습니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>
                제16조 (이용자의 개인정보 등 보호)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회사”는 관련 법령이 정하는 바에 따라서 회원 등록정보를
                포함한 회원의 개인정보를 보호하기 위하여 노력합니다.
                <br />
                2. “회원”의 개인정보보호에 관해서는 관련법령 및 회사가 정하는
                개인정보취급방침에 정한 바에 의합니다.
                <br />
                3. “회사”는 정보통신망 이용촉진 및 정보보호등에 관한 법률 등
                관계 법령에 따라 “회원”의 사전 동의를 얻은 경우, 동의를 받은
                범위 내에서 “회원”의 개인정보를 제3자에게 제공하며, 회사의
                ‘개인정보취급방침’에 그 절차와 방법등에 대하여 상세히 기재하도록
                합니다.
                <br />
                4. “회사”가 “플랫폼”을 통하여 게재, 공시하는
                “개인정보취급방침”은 본 약관의 일부를 구성하며, “회원”은 이에
                동의합니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>
                제17조 (개인정보의 제공, 위탁)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회사”는수집된 개인정보의 취급 및 관리 등의 업무(이하
                “업무”)를 스스로 수행함을 원칙으로 하나, 필요한 경우 업무의 일부
                또는전부를 “회사”가 선정한 업체에 위탁할 수 있습니다.
                <br />
                2. 개인정보의 취급 및 관리 등의 업무를제3자 등에게 위탁하게 될
                경우, “회사”가 정하는 “개인정보취급방침”에제반 사항을 기재하여
                “회원”에게 고지, 안내합니다.
              </p>
            </div>
          </div>

          <hr />

          <div>
            <p className='font-semibold text-[0.5rem] underline'>
              제5장. 계약해지 및 이용제한 등
            </p>
            <div>
              <p className='mt-4 text-xs font-medium'>
                제18조 (계약해지 및 이용제한)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회원”은이용계약을 해지하고자 하는 경우 “플랫폼” 내부의
                고객문의기능을 이용하여, 해지의사를 통보해야 하며, 해지신청이
                접수완료되면 이용계약은 즉시 종료됩니다.
                <br />
                2. “회사”는 “회원”이 본 약관을 위반하는 경우 사전통지 없이 즉시
                이용계약을 해지할 수 있습니다.
                <br />
                3. “회사”는 본 조 제1항의 해지신청이 접수되면 이용고객이 요청한
                해지일로부터 플랫폼 이용을 제한합니다. 단, “회원”이 진행중인
                파티에 가입하거나, 파티를 생성하여 운영 중인 경우, 혹은 잔여
                버디 머니 반환이 불가능한 경우, 해당 문제가 해결될 때까지 접수
                완료 처리를 지연할 수 있습니다.
                <br />
                4. 본 조 제1항 및 제2항에 의하여 이용계약이 해지되면, 해당
                회원이 등록한 개인정보는 회사의 개인정보보호정책에 따라
                말소됩니다.
                <br />
                5. 본 조 제2항에 의해 해지된 회원에 대하여는 귀책사유가 해소될
                때까지 가입을 제한할 수 있습니다.
                <br />
                6. 본 약관에 의거하여 계약이 해지되었을경우 회사는 해당 플랫폼
                관련 데이터 보관의무 및 데이터 제공의무가 없습니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>
                제19조 (버디 머니 반환)
              </p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회사”는 “회원”의 인출 요청이나, 해지신청이 있는 경우 정해진
                절차에 따라 버디 머니를 반환합니다.
                <br />
                2. “회사”는 “회원”이 등록한 인출 정보로 반환이 불가능하거나,
                해지신청 없이 “플랫폼” 이용을중단하는 경우, 버디 머니를
                보관하고, 이를 회원 정보에기재된 연락처 등으로 통지합니다. 단,
                버디 머니는 마지막 접속일로부터 상법 제64조의 상사시효제도에
                준하여 최대 5년까지 보관하며, 그 이후 “회사”에 귀속됩니다.
                <br />
                3. 본 약관 제16조에서 규정한 개인정보보호 규정에 의해 회원 정보
                조회 및 대조가 불가능해질 경우 해당 책임은 “회원”에게 있습니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>제20조 (환불)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회원”이 파티 구성원으로서 지불한 보증금 및 위약금은 계약금
                성격으로서 반환청구권이 상실되며, 이에 대한 동의를미리
                진행합니다. 단, 파티 운영과 관련하여 파티 구성원에대해 유무형의
                피해를 야기하지 않는다고 판단되는 경우 반환될 수 있습니다.
                <br />
                2. “회원”이 파티원으로서 지불한 분담금 및 버디 이용료는 파티가
                시작한 경우 파티 시작일을 기준으로 일할 계산하여 환불받을 수
                있습니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>제21조 (양도금지)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회원”은 “플랫폼”의 이용권한, 기타계약상 지위를 타인에게
                양도, 증여할 수 없습니다.
                <br />
                2. 구독공유에 대한 모든 권리 및 책임은 해당 파티를 생성하거나
                가입한 “회원”에게 있습니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>제22조 (손해배상)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회사”의 고의 또는 중대한 과실로 인하여 “회원”에게 손해가
                발생한경우 “회사”는 “회원”에게 실제 발생한 손해만을 배상합니다.
                <br />
                2. “회원”이 서비스를 이용함에 있어 행한 불법행위나 본 약관
                위반행위로 인하여 회사가 당해 회원 이외의 제3자로부터 손해배상
                청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 “회원”은
                자신의 책임과 비용으로 “회사”를 면책하여야 하며, “회사”가
                면책되지 못한 경우 당해 “회원”은 그로 인하여 회사에 발생한 모든
                손해를 배상하여야 합니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>제23조 (면책사항)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “회사”는 천재지변 또는 이에 준하는 불가항력으로 인하여
                서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이
                면제됩니다.
                <br />
                2. “회사”는 “회원”의 귀책사유로 인한 “플랫폼”의 이용장애에
                대하여 책임을 지지 않습니다.
                <br />
                3. 회사는 회이 구독 공유하는 서비스의 이용에 대해 보장 및 책임을
                지지 않습니다.
                <br />
                4. “회사”는 “회원”이 “플랫폼”을 이용하여 기대하는 수익을 상실한
                것에 대하여 책임을 지지 않으며 그 밖에 “플랫폼”을 통하여 얻은
                자료로 인한 손해 등에 대하여도 책임을 지지 않습니다.
              </p>
            </div>

            <div>
              <p className='mt-4 text-xs font-medium'>제24조 (관할법원)</p>
              <p className='mt-1 text-xs leading-relaxed text-gray-500 dark:text-gray-400'>
                1. “플랫폼” 이용과 관련하여 “회사”와 “회원” 사이에 분쟁이 발생한
                경우,“회사”와 “회원”은 분쟁의 해결을 위해 성실히 협의합니다.
                <br />
                2. 본 조 제1항의 협의에서도 분쟁이 해결되지 않을 경우 양
                당사자는 민사소송법상의 관할법원에 소를 제기할 수 있습니다.
                <br />
                3. “회사”와 “회원”간에 제기된 소송에는 대한민국 법을 적용합니다.
              </p>
            </div>
          </div>
        </div>
      </Modal.Body>
      <Modal.Footer className='ml-auto border-none'>
        <button
          onClick={() => setOpenTermsOfServiceModal(undefined)}
          className='text-white bg-[#3a8af9] px-4 py-[0.4rem] rounded-[0.45rem] text-[0.8rem] font-bold focus:bg-[#1c6cdb] hover:bg-[#1c6cdb] box-shadow'
        >
          닫기
        </button>
      </Modal.Footer>
    </Modal>
  );
}
